W8D1/reddit/app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", " cat"], ["url", "cats.in"], ["content", "cats are good  "], ["sub_id", 1], ["user_id", 1], ["created_at", "2019-10-07 21:26:49.400278"], ["updated_at", "2019-10-07 21:26:49.400278"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", " Donkey and Giraffe Tips"], ["url", "  www.donkey.com"], ["content", "   Some thoughts about donkeys and giraffes. "], ["updated_at", "2019-10-07 23:29:31.483669"], ["id", 5]]

  def destroy
    @post = Post.find(params[:id])
    if @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 5]]