W8D1/reddit/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.user_id = current_user.id

    if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Cats"], ["description", "all about cats"], ["user_id", 3], ["created_at", "2019-10-07 18:50:14.187426"], ["updated_at", "2019-10-07 18:50:14.187426"]]

  def show
    @sub = Sub.find(params[:id])
---
SELECT "post_subs".* FROM "post_subs" WHERE "post_subs"."sub_id" = $1  [["sub_id", 2]]
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "tips about laser pointers"], ["updated_at", "2019-10-07 19:04:08.308988"], ["id", 1]]

  def destroy
    @sub = current_user.subs.find(params[:id])
    if @sub.destroy
---
SELECT  "subs".* FROM "subs" WHERE "subs"."user_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
DELETE FROM "subs" WHERE "subs"."id" = $1  [["id", 1]]