W7D2/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "ou2i8R3GIdapj-Y6z3vv4A"], ["updated_at", "2019-10-01 23:04:36.704926"], ["id", 2]]
---
  def reset_session_token!
    self.update!(session_token: self.class.generate_session_token)